CF/Catalogs/ВариантыРаспределенияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ВариантыРаспределенияТоваров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОтгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриПоступлении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальныеНастройкиДляМагазинов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/InformationRegisters/НастройкиВариантовРаспределенияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВариантовРаспределенияТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкиВарианта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВариантРаспределенияТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыРаспределенияТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/Catalogs/ВариантыРаспределенияТоваров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	
	
КонецПроцедуры

Функция НастройкиРаспределения(ВариантРаспределения, Магазин = Неопределено) Экспорт
	
	ИндивидуальныеНастройкиДляМагазинов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВариантРаспределения, "ИндивидуальныеНастройкиДляМагазинов");
	
	Если ИндивидуальныеНастройкиДляМагазинов и не ТипЗнч(Магазин) = Тип("СправочникСсылка.Магазины") Тогда
		ОписаниеОшибки = НСтр("ru = 'Для варианта распределения %1 необходимо указать магазин'");
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, ВариантРаспределения);
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиВариантовРаспределенияТоваров.НастройкиВарианта КАК НастройкиВарианта
	|ИЗ
	|	РегистрСведений.НастройкиВариантовРаспределенияТоваров КАК НастройкиВариантовРаспределенияТоваров
	|ГДЕ
	|	НастройкиВариантовРаспределенияТоваров.ВариантРаспределенияТоваров = &ВариантРаспределения";
	Запрос.УстановитьПараметр("ВариантРаспределения", ВариантРаспределения);
	
	Если ИндивидуальныеНастройкиДляМагазинов Тогда
		Запрос.Текст = Запрос.Текст + " И НастройкиВариантовРаспределенияТоваров.Магазин = &Магазин";
		Запрос.УстановитьПараметр("Магазин", Магазин);
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.НастройкиВарианта.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ВыполнитьРаспределениеТоваров(Магазин, ВариантРаспределения, ТоварыФакт, СерийныеНомераФакт, ТоварыПеремещение, СерийныеНомераПеремещение, ФормаРаспределения, НастройкиВарианта = Неопределено, ИдентификаторыВыделенныхСтрок) Экспорт
	
	Если НастройкиВарианта = Неопределено Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Настройки.НастройкиВарианта КАК НастройкиВарианта
		|ИЗ
		|	РегистрСведений.НастройкиВариантовРаспределенияТоваров КАК Настройки
		|ГДЕ
		|	Настройки.ВариантРаспределенияТоваров = &ВариантРаспределенияТоваров
		|	И (Настройки.Магазин = &Магазин
		|			ИЛИ не Настройки.ВариантРаспределенияТоваров.ИндивидуальныеНастройкиДляМагазинов)";
		Запрос.УстановитьПараметр("ВариантРаспределенияТоваров", ВариантРаспределения);
		Запрос.УстановитьПараметр("Магазин", Магазин);
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			НастройкиВарианта = Результат.НастройкиВарианта;
		Иначе
			ТекстОшибки = НСтр("ru = 'При чтении настроек распределения произошла ошибка, выполнение распределения невозможно. Обратитесь к Администратору'");
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	ВнешняяОбработка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВариантРаспределения, "ВнешняяОбработка");
	ВнешняяОбработкаОбъект = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ВнешняяОбработка);
	ВнешняяОбработкаОбъект.ВыполнитьРаспределение(ТоварыФакт, СерийныеНомераФакт, ТоварыПеремещение, СерийныеНомераПеремещение, НастройкиВарианта, ИдентификаторыВыделенныхСтрок, ФормаРаспределения);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
